; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v13)
             (pred_7 ?v10 ?v5)
             (pred_3 ?v8 ?v5)
             (pred_1 ?v7 ?v8 )
	     (pred_12 ?v8)
             (pred_10 ?v1)
             (pred_6 ?v10)
             (pred_4 ?v5)
             (pred_8 ?v8)
             (pred_2 ?v10)
             (pred_9 ?v8)
             (pred_11 ))



(:action op_5
:parameters (?v3 ?v4 ?v2 ?v6)
:precondition (and (pred_10 ?v3) (pred_10 ?v4) (pred_6 ?v2) (pred_4 ?v6)
          (pred_5 ?v3 ?v4) (pred_7 ?v2 ?v6)
                   (pred_3 ?v4 ?v6) (pred_12 ?v3) 
                   (pred_8 ?v4) (pred_2 ?v2))
:effect (and  (pred_9 ?v4) (not (pred_8 ?v4))))


(:action op_4
:parameters (?v3 ?v9)
:precondition (and (pred_10 ?v3) (pred_10 ?v9)
               (pred_12 ?v3) (pred_5 ?v3 ?v9) (pred_9 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v3))))

(:action op_1
:parameters (?v3 ?v2)
:precondition (and (pred_10 ?v3) (pred_6 ?v2) 
                  (pred_12 ?v3) (pred_1 ?v2 ?v3) (pred_11 ))
:effect (and (pred_2 ?v2)
   (not (pred_1 ?v2 ?v3)) (not (pred_11 ))))


(:action op_3
:parameters (?v3 ?v12 ?v11)
:precondition (and (pred_10 ?v3) (pred_6 ?v12) (pred_6 ?v11)
                  (pred_12 ?v3) (pred_2 ?v11) (pred_1 ?v12 ?v3))
:effect (and (pred_2 ?v12) (pred_1 ?v11 ?v3)
        (not (pred_2 ?v11)) (not (pred_1 ?v12 ?v3))))

(:action op_2
:parameters (?v3 ?v2)
:precondition (and (pred_10 ?v3) (pred_6 ?v2) 
                  (pred_12 ?v3) (pred_2 ?v2))
:effect (and (pred_11 ) (pred_1 ?v2 ?v3) (not (pred_2 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_02 obj_04 obj_09 obj_12 obj_07 obj_01 obj_11 obj_03
    obj_10 obj_13
    obj_05 obj_08
    )

    (:init
       (pred_11)

       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_07)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_08)

       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_02)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_03 obj_11)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_3  obj_09 obj_10)
       (pred_3  obj_01 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_03)

       (pred_7  obj_05 obj_10)
       (pred_7  obj_08 obj_13)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_08 obj_09)
       (pred_12 obj_03)
    )

    (:goal (and
       (pred_1 obj_05 obj_04)
    ))
(:constraints
  (always (not (pred_12 obj_07)))
)
)

; plan
1. (op_1 obj_03 obj_05)
   deleted: (pred_1 obj_05 obj_03) (pred_11)
   added: (pred_2 obj_05)
   goals met: 0 of 1
2. (op_4 obj_03 obj_11)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_12)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_02)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_04)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_11) (pred_1 obj_05 obj_04)
   goals met: 1 of 1
